SpenceKonde/DxCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrda.menu.chip.avr128da28=AVR128DA28
avrda.menu.chip.avr128da28.build.mcu=avr128da28
avrda.menu.chip.avr128da28.upload.maximum_size=131072
avrda.menu.chip.avr128da28.upload.maximum_data_size=16384
avrda.menu.chip.avr128da28.build.variant=28pin-standard
avrda.menu.chip.avr128da32=AVR128DA32
avrda.menu.chip.avr128da32.build.mcu=avr128da32
avrda.menu.chip.avr128da32.upload.maximum_size=131072
avrda.menu.chip.avr128da32.upload.maximum_data_size=16384
avrda.menu.chip.avr128da32.build.variant=32pin-standard
avrda.menu.chip.avr128da48=AVR128DA48
avrda.menu.chip.avr128da48.build.mcu=avr128da48
avrda.menu.chip.avr128da48.upload.maximum_size=131072
avrda.menu.chip.avr128da48.upload.maximum_data_size=16384
avrda.menu.chip.avr128da48.build.variant=48pin-standard
avrda.menu.chip.avr128da64=AVR128DA64
avrda.menu.chip.avr128da64.build.mcu=avr128da64
avrda.menu.chip.avr128da64.upload.maximum_size=131072
avrda.menu.chip.avr128da64.upload.maximum_data_size=16384
avrda.menu.chip.avr128da64.build.variant=64pin-standard
avrda.menu.chip.avr64da28=AVR64DA28
avrda.menu.chip.avr64da28.build.mcu=avr64da28
avrda.menu.chip.avr64da28.upload.maximum_size=65536
avrda.menu.chip.avr64da28.upload.maximum_data_size=8192
avrda.menu.chip.avr64da28.build.variant=28pin-standard
avrda.menu.chip.avr64da32=AVR64DA32
avrda.menu.chip.avr64da32.build.mcu=avr64da32
avrda.menu.chip.avr64da32.upload.maximum_size=65536
avrda.menu.chip.avr64da32.upload.maximum_data_size=8192
avrda.menu.chip.avr64da32.build.variant=32pin-standard
avrda.menu.chip.avr64da48=AVR64DA48
avrda.menu.chip.avr64da48.build.mcu=avr64da48
avrda.menu.chip.avr64da48.upload.maximum_size=65536
avrda.menu.chip.avr64da48.upload.maximum_data_size=8192
avrda.menu.chip.avr64da48.build.variant=48pin-standard
avrda.menu.chip.avr64da64=AVR64DA64
avrda.menu.chip.avr64da64.build.mcu=avr64da64
avrda.menu.chip.avr64da64.upload.maximum_size=65536
avrda.menu.chip.avr64da64.upload.maximum_data_size=8192
avrda.menu.chip.avr64da64.build.variant=64pin-standard
avrda.menu.chip.avr32da28=AVR32DA28
avrda.menu.chip.avr32da28.build.mcu=avr32da28
avrda.menu.chip.avr32da28.upload.maximum_size=32768
avrda.menu.chip.avr32da28.upload.maximum_data_size=4096
avrda.menu.chip.avr32da28.build.variant=28pin-standard
avrda.menu.chip.avr32da32=AVR32DA32
avrda.menu.chip.avr32da32.build.mcu=avr32da32
avrda.menu.chip.avr32da32.upload.maximum_size=32768
avrda.menu.chip.avr32da32.upload.maximum_data_size=4096
avrda.menu.chip.avr32da32.build.variant=32pin-standard
avrda.menu.chip.avr32da48=AVR32DA48
avrda.menu.chip.avr32da48.build.mcu=avr32da48
avrda.menu.chip.avr32da48.upload.maximum_size=32768
avrda.menu.chip.avr32da48.upload.maximum_data_size=4096
avrda.menu.chip.avr32da48.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrda.menu.clock.24internal=24 MHz internal
avrda.menu.clock.24internal.build.f_cpu=24000000L
avrda.menu.clock.24internal.build.speed=24
avrda.menu.clock.24internal.build.clocksource=0
avrda.menu.clock.20internal=20 MHz internal
avrda.menu.clock.20internal.build.f_cpu=20000000L
avrda.menu.clock.20internal.build.speed=20
avrda.menu.clock.20internal.build.clocksource=0
avrda.menu.clock.16internal=16 MHz internal
avrda.menu.clock.16internal.build.f_cpu=16000000L
avrda.menu.clock.16internal.build.speed=16
avrda.menu.clock.16internal.build.clocksource=0
avrda.menu.clock.12internal=12 MHz internal
avrda.menu.clock.12internal.build.f_cpu=12000000L
avrda.menu.clock.12internal.build.speed=12
avrda.menu.clock.12internal.build.clocksource=0
avrda.menu.clock.10internal=10 MHz internal
avrda.menu.clock.10internal.build.f_cpu=10000000L
avrda.menu.clock.10internal.build.speed=10
avrda.menu.clock.10internal.build.clocksource=0
avrda.menu.clock.8internal=8 MHz internal
avrda.menu.clock.8internal.build.f_cpu=8000000L
avrda.menu.clock.8internal.build.speed=8
avrda.menu.clock.8internal.build.clocksource=0
avrda.menu.clock.4internal=4 MHz internal
avrda.menu.clock.4internal.build.f_cpu=4000000L
avrda.menu.clock.4internal.build.speed=4
avrda.menu.clock.4internal.build.clocksource=0
avrda.menu.clock.1internal=1 MHz internal
avrda.menu.clock.1internal.build.f_cpu=1000000L
avrda.menu.clock.1internal.build.speed=1
avrda.menu.clock.1internal.build.clocksource=0
avrda.menu.clock.24extclock=24 MHz ext. clock
avrda.menu.clock.24extclock.build.f_cpu=24000000L
avrda.menu.clock.24extclock.build.speed=24
avrda.menu.clock.24extclock.build.clocksource=2
avrda.menu.clock.20extclock=20 MHz ext. clock
avrda.menu.clock.20extclock.build.f_cpu=20000000L
avrda.menu.clock.20extclock.build.speed=20
avrda.menu.clock.20extclock.build.clocksource=2
avrda.menu.clock.16extclock=16 MHz ext. clock
avrda.menu.clock.16extclock.build.f_cpu=16000000L
avrda.menu.clock.16extclock.build.speed=16
avrda.menu.clock.16extclock.build.clocksource=2
avrda.menu.clock.12extclock=12 MHz ext. clock
avrda.menu.clock.12extclock.build.f_cpu=12000000L
avrda.menu.clock.12extclock.build.speed=12
avrda.menu.clock.12extclock.build.clocksource=2
avrda.menu.clock.8extclock=8 MHz ext. clock
avrda.menu.clock.8extclock.build.f_cpu=8000000L
avrda.menu.clock.8extclock.build.speed=8
avrda.menu.clock.8extclock.build.clocksource=2
avrda.menu.clock.28internal=28 MHz internal (overclocked)
avrda.menu.clock.28internal.build.f_cpu=28000000L
avrda.menu.clock.28internal.build.speed=28
avrda.menu.clock.28internal.build.clocksource=0
avrda.menu.clock.32internal=32 MHz internal (overclocked)
avrda.menu.clock.32internal.build.f_cpu=32000000L
avrda.menu.clock.32internal.build.speed=32
avrda.menu.clock.32internal.build.clocksource=0
avrda.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrda.menu.clock.25extclock.build.f_cpu=25000000L
avrda.menu.clock.25extclock.build.speed=25
avrda.menu.clock.25extclock.build.clocksource=2
avrda.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda.menu.clock.28extclock.build.f_cpu=28000000L
avrda.menu.clock.28extclock.build.speed=28
avrda.menu.clock.28extclock.build.clocksource=2
avrda.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrda.menu.clock.30extclock.build.f_cpu=30000000L
avrda.menu.clock.30extclock.build.speed=30
avrda.menu.clock.30extclock.build.clocksource=2
avrda.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda.menu.clock.32extclock.build.f_cpu=32000000L
avrda.menu.clock.32extclock.build.speed=32
avrda.menu.clock.32extclock.build.clocksource=2
avrda.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda.menu.clock.36extclock.build.f_cpu=36000000L
avrda.menu.clock.36extclock.build.speed=36
avrda.menu.clock.36extclock.build.clocksource=2
avrda.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda.menu.clock.40extclock.build.f_cpu=40000000L
avrda.menu.clock.40extclock.build.speed=40
avrda.menu.clock.40extclock.build.clocksource=2
avrda.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda.menu.clock.48extclock.build.f_cpu=48000000L
avrda.menu.clock.48extclock.build.speed=48
avrda.menu.clock.48extclock.build.clocksource=2

