SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdb.menu.bodvoltage.1v9=1.9V
avrdb.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdb.menu.bodvoltage.2v45=2.45V
avrdb.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdb.menu.bodvoltage.2v70=2.70V
avrdb.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdb.menu.bodvoltage.2v85=2.85V
avrdb.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdb.menu.bodmode.disabled=Disabled/Disabled
avrdb.menu.bodmode.enabled=Enabled/Enabled
avrdb.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdb.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdb.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdb.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdb.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdb.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdb.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdb.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdb.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdb.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdb.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdb.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdb.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdb.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdb.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdb.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrdb.menu.eesave.enable=EEPROM retained
avrdb.menu.eesave.enable.bootloader.eesavebit=1
avrdb.menu.eesave.disable=EEPROM not retained
avrdb.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdb.menu.resetpin.reset=Hardware Reset (recommended)
avrdb.menu.resetpin.reset.bootloader.resetpinbits=10
avrdb.menu.resetpin.input=Input (no output, ever)
avrdb.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdb.menu.millis.tcb2=TCB2 (recommended)
avrdb.menu.millis.disabled=Disabled (delay() only)
avrdb.menu.millis.tcb0=TCB0
avrdb.menu.millis.tcb1=TCB1
avrdb.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdb.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdb.menu.millis.tca0=TCA0
avrdb.menu.millis.tca1=TCA1 (48/64-pin parts only)
#avrdb.menu.millis.tcd0=TCD0
avrdb.menu.millis.tcb0.build.millistimer=B0
avrdb.menu.millis.tcb1.build.millistimer=B1
avrdb.menu.millis.tcb2.build.millistimer=B2
avrdb.menu.millis.tcb3.build.millistimer=B3
avrdb.menu.millis.tcb4.build.millistimer=B4
avrdb.menu.millis.tca0.build.millistimer=A0
avrdb.menu.millis.tca1.build.millistimer=A1
#avrdb.menu.millis.tcd0.build.millistimer=D0
avrdb.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdb.menu.printf.default=Default, 1.5k flash, no floats
avrdb.menu.printf.default.build.printf=
avrdb.menu.printf.full=Full, 2.6k, prints floats
avrdb.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdb.menu.printf.full.build.printfabr=.pfF
avrdb.menu.printf.minimal=Minimal, 1.1k flash used
avrdb.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdb.menu.printf.minimal.build.printfabr=.pfM


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#

avrdb.menu.attach.allenabled=On all pins, like usual
avrdb.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdb.menu.attach.manual=Only enabled ports. Please see documentation.
avrdb.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdb.menu.attach.oldversion=Old version, new one is worse!
avrdb.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD

#----------------------------------------#
# MVIO menu                              #
#________________________________________#

avrdb.menu.mvio.enabled=Enabled
avrdb.menu.mvio.enabled.bootloader.mviobits=01
avrdb.menu.mvio.disabled=Disabled
avrdb.menu.mvio.disabled.bootloader.mviobits=10

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdb.menu.startuptime.8=8ms
avrdb.menu.startuptime.0=0ms
avrdb.menu.startuptime.1=1ms
avrdb.menu.startuptime.2=2ms
avrdb.menu.startuptime.4=4ms
avrdb.menu.startuptime.16=16ms
avrdb.menu.startuptime.32=32ms
avrdb.menu.startuptime.64=64ms
avrdb.menu.startuptime.0.bootloader.sutbits=000
avrdb.menu.startuptime.1.bootloader.sutbits=001
avrdb.menu.startuptime.2.bootloader.sutbits=010
avrdb.menu.startuptime.4.bootloader.sutbits=011
avrdb.menu.startuptime.8.bootloader.sutbits=100
avrdb.menu.startuptime.16.bootloader.sutbits=101
avrdb.menu.startuptime.32.bootloader.sutbits=110
avrdb.menu.startuptime.64.bootloader.sutbits=111


avrdb.menu.wire.mors1=1x Wire, Master or Slave (least Flash & RAM)
avrdb.menu.wire.mors1.build.wire.mode=MORS
avrdb.menu.wire.mors1.build.wire.count=WIRE0
avrdb.menu.wire.mands1=1x Wire, Master and Slave
avrdb.menu.wire.mands1.build.wire.mode=MANDS
avrdb.menu.wire.mors1.build.wire.count=WIRE0
avrdb.menu.wire.mors2=2x Wire, Master or Slave (not available on 28-pin devices)
avrdb.menu.wire.mors2.build.wire.mode=MORS
avrdb.menu.wire.mors2.build.wire.count=WIRE1
avrdb.menu.wire.mands2=2x Wire, Master and Slave (not available on 28-pin devices)
avrdb.menu.wire.mands2.build.wire.mode=MANDS
avrdb.menu.wire.mands2.build.wire.count=WIRE1

#----------------------------------------#
# SPM (writing flash from app)           #
#________________________________________#
avrdb.menu.appspm.no=Disabled
avrdb.menu.appspm.no.bootloader.appspm=
avrdb.menu.appspm.no.build.appspmabr=
avrdb.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdb.menu.appspm.full=Anywhere
avrdb.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdb.menu.appspm.full.build.appspmabr=.spmALL
avrdb.menu.appspm.16plus=Above 16k
avrdb.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdb.menu.appspm.16plus.bootloader.CODESIZE=32
avrdb.menu.appspm.24plus=Above 24k
avrdb.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdb.menu.appspm.24plus.bootloader.CODESIZE=48
avrdb.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrdb.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdb.menu.appspm.32plus.bootloader.CODESIZE=64
avrdb.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrdb.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdb.menu.appspm.48plus.bootloader.CODESIZE=96
avrdb.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrdb.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdb.menu.appspm.56plus.bootloader.CODESIZE=112
avrdb.menu.appspm.64plus=Above 64k (AVR128 only)
avrdb.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrdb.menu.appspm.64plus.bootloader.CODESIZE=128
avrdb.menu.appspm.96plus=Above 96k (AVR128 only)
avrdb.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrdb.menu.appspm.96plus.bootloader.CODESIZE=192
avrdb.menu.appspm.112plus=Above 112k (AVR128 only)
avrdb.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrdb.menu.appspm.112plus.bootloader.CODESIZE=224

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
#avrdd.upload.tool=avrdude
#avrdd.build.board=avrda
#avrdd.build.core=dxcore
#avrdd.build.text_section_start=.text=0x0
#avrdd.build.extra_flags= -DTWI_{build.wire.mode} {bootloader.appspm}
#avrdd.build.export_merged_output=false
#avrdd.build.printf=
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
#avrdd.bootloader.tool=avrdude
#avrdd.bootloader.WDTCFG=0x00
#avrdd.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
#avrdd.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
#avrdd.bootloader.CODESIZE=0x00
#avrdd.bootloader.BOOTSIZE=0x01
#avrdd.bootloader.avrdudestring=
#avrdd.bootloader.pymcuprogstring=-aerase
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
#avrdd.build.mcupostfix=
#avrdd.build.printfabr=
#avrdd.build.appspmabr=.spm{bootloader.CODESIZE}

