SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
#avrdd.menu.bodvoltage.1v9=1.9V
#avrdd.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrdd.menu.bodvoltage.2v45=2.45V
#avrdd.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrdd.menu.bodvoltage.2v70=2.70V
#avrdd.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrdd.menu.bodvoltage.2v85=2.85V
#avrdd.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrdd.menu.bodmode.disabled=Disabled/Disabled
#avrdd.menu.bodmode.enabled=Enabled/Enabled
#avrdd.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrdd.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrdd.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrdd.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrdd.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrdd.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrdd.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrdd.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrdd.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrdd.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrdd.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrdd.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrdd.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrdd.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrdd.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrdd.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
#avrdd.menu.eesave.enable=EEPROM retained
#avrdd.menu.eesave.enable.bootloader.eesavebit=1
#avrdd.menu.eesave.disable=EEPROM not retained
#avrdd.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
#avrdd.menu.resetupdipins.reset=Reset & UPDI
#avrdd.menu.resetupdipins.reset.bootloader.resetpinbits=11
#avrdd.menu.resetupdipins.input=Input & UPDI (no challenges)
#avrdd.menu.resetupdipins.input.bootloader.resetpinbits=10
#avrdd.menu.resetupdipins.reset=Reset & GPIO (DD-compatible HV UPDI required)
#avrdd.menu.resetupdipins.reset.bootloader.resetpinbits=01
#avrdd.menu.resetupdipins.input=Input & GPIO (DD-compatible HV UPDI required)
#avrdd.menu.resetupdipins.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
#avrdd.menu.millis.tcbhighest=Default (recommended)
#avrdd.menu.millis.disabled=Disabled (delay() only)
#avrdd.menu.millis.tcb0=TCB0
#avrdd.menu.millis.tcb1=TCB1 (default for 14/20 pins)
#avrdd.menu.millis.tcb2=TCB2 (default for 28/32 pins)
#avrdd.menu.millis.tca0=TCA0
#avrdd.menu.millis.tcbhighest.build.millistimer={build.highestcb}
#avrdd.menu.millis.tcb0.build.millistimer=B0
#avrdd.menu.millis.tcb1.build.millistimer=B1
#avrdd.menu.millis.tcb2.build.millistimer=B2
#avrdd.menu.millis.tca0.build.millistimer=A0
##avrdd.menu.millis.tcd0.build.millistimer=D0
#avrdd.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
#avrdd.menu.printf.default=Default, 1.5k flash, no floats
#avrdd.menu.printf.full=Full, 2.6k, prints floats
#avrdd.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrdd.menu.printf.full.build.printfabr=.pfF
#avrdd.menu.printf.minimal=Minimal, 1.1k flash used
#avrdd.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrdd.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# MVIO menu                              #
#________________________________________#
#avrdd.menu.mvio.enabled=Enabled
#avrdd.menu.mvio.enabled.bootloader.mviobits=01
#avrdd.menu.mvio.disabled=Disabled
#avrdd.menu.mvio.disabled.bootloader.mviobits=10

#----------------------------------------#
# Startup time options                   #
#________________________________________#
#avrdd.menu.startuptime.8=8ms
#avrdd.menu.startuptime.0=0ms
#avrdd.menu.startuptime.1=1ms
#avrdd.menu.startuptime.2=2ms
#avrdd.menu.startuptime.4=4ms
#avrdd.menu.startuptime.16=16ms
#avrdd.menu.startuptime.32=32ms
#avrdd.menu.startuptime.64=64ms
#avrdd.menu.startuptime.0.bootloader.sutbits=000
#avrdd.menu.startuptime.1.bootloader.sutbits=001
#avrdd.menu.startuptime.2.bootloader.sutbits=010
#avrdd.menu.startuptime.4.bootloader.sutbits=011
#avrdd.menu.startuptime.8.bootloader.sutbits=100
#avrdd.menu.startuptime.16.bootloader.sutbits=101
#avrdd.menu.startuptime.32.bootloader.sutbits=110
#avrdd.menu.startuptime.64.bootloader.sutbits=111




#avrdd.menu.wire.mors1=1x Wire, Master or Slave
#avrdd.menu.wire.mors1.build.wire.mode=MORS
#avrdd.menu.wire.mors1.build.wire.count=WIRE0
#avrdd.menu.wire.mands1=1x Wire, Master and Slave
#avrdd.menu.wire.mands1.build.wire.mode=MANDS
#avrdd.menu.wire.mors1.build.wire.count=WIRE0

#----------------------------------------#
# SPM (writing flash from app)           #
# will initially be disabled until       #
# until size of these "pages" is         #
# known to be either 512 or 256b.        #
#________________________________________#
#avrdd.menu.appspm.no=Disabled (be patient!)
#avrdd.menu.appspm.no.bootloader.appspm=
#avrdd.menu.appspm.no.build.appspmabr=
#avrdd.menu.appspm.no.bootloader.BOOTSIZE=0x00
##avrdd.menu.appspm.full=Anywhere
##avrdd.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
#avrdd.menu.appspm.full.build.appspmabr=.spmALL
##avrdd.menu.appspm.16plus=Above 16k
##avrdd.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
##avrdd.menu.appspm.16plus.bootloader.CODESIZE=32
##avrdd.menu.appspm.24plus=Above 24k
##avrdd.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
##avrdd.menu.appspm.24plus.bootloader.CODESIZE=48
##avrdd.menu.appspm.32plus=Above 32k (AVR128/64 only)
##avrdd.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
##avrdd.menu.appspm.32plus.bootloader.CODESIZE=64
##avrdd.menu.appspm.48plus=Above 48k (AVR128/64 only)
##avrdd.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
##avrdd.menu.appspm.48plus.bootloader.CODESIZE=96
##avrdd.menu.appspm.56plus=Above 56k (AVR128/64 only)
##avrdd.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
##avrdd.menu.appspm.56plus.bootloader.CODESIZE=112
##avrdd.menu.appspm.64plus=Above 64k (AVR128 only)
##avrdd.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
##avrdd.menu.appspm.64plus.bootloader.CODESIZE=128
##avrdd.menu.appspm.96plus=Above 96k (AVR128 only)
##avrdd.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
##avrdd.menu.appspm.96plus.bootloader.CODESIZE=192
##avrdd.menu.appspm.112plus=Above 112k (AVR128 only)
##avrdd.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
##avrdd.menu.appspm.112plus.bootloader.CODESIZE=224

##########################################################################
#                                                                        #
###                 ###  #     # ####      #####   ###                 ###
#####              #   # #     # #   #     #      #   #              #####
#######            #####  #   #  ####  ### ####   #####            #######
#####              #   #   # #   # #       #      #   #              #####
###                #   #    #    #  #      #####  #   #                ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for EA parts   #
#________________________________________#
#avrea.upload.tool=avrdude
#avrea.build.board=avrda
#avrea.build.core=dxcore
#avrea.build.text_section_start=.text=0x0
#avrea.build.extra_flags= -DTWI_{build.wire.mode}
#avrea.build.export_merged_output=false
#avrea.build.printf=
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
#avrea.bootloader.tool=avrdude
#avrea.bootloader.WDTCFG=0x00
#avrea.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
#avrea.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrea.bootloader.CODESIZE=0x00
#avrea.bootloader.BOOTSIZE=0x01
#avrea.bootloader.avrdudestring=
#avrea.bootloader.pymcuprogstring=-aerase
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
#avrea.build.mcupostfix=
#avrea.build.printfabr=

