SpenceKonde/DxCore/megaavr/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA (Optiboot) submenu options          #
#____________________________________________#
#                                        #
# Chip (memory and pincount)             #
#________________________________________#
avrdaopti.menu.chip.avr128da28=AVR128DA28
avrdaopti.menu.chip.avr128da28.build.mcu=avr128da28
avrdaopti.menu.chip.avr128da28.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da28.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.avr128da28.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr128da32=AVR128DA32
avrdaopti.menu.chip.avr128da32.build.mcu=avr128da32
avrdaopti.menu.chip.avr128da32.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da32.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.avr128da32.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr128da48=AVR128DA48
avrdaopti.menu.chip.avr128da48.build.mcu=avr128da48
avrdaopti.menu.chip.avr128da48.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da48.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.avr128da48.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr128da64=AVR128DA64
avrdaopti.menu.chip.avr128da64.build.mcu=avr128da64
avrdaopti.menu.chip.avr128da64.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da64.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.avr128da64.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da64.build.variant=64pin-standard
avrdaopti.menu.chip.avr64da28=AVR64DA28
avrdaopti.menu.chip.avr64da28.build.mcu=avr64da28
avrdaopti.menu.chip.avr64da28.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da28.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.avr64da28.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr64da32=AVR64DA32
avrdaopti.menu.chip.avr64da32.build.mcu=avr64da32
avrdaopti.menu.chip.avr64da32.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da32.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.avr64da32.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr64da48=AVR64DA48
avrdaopti.menu.chip.avr64da48.build.mcu=avr64da48
avrdaopti.menu.chip.avr64da48.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da48.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.avr64da48.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr64da64=AVR64DA64
avrdaopti.menu.chip.avr64da64.build.mcu=avr64da64
avrdaopti.menu.chip.avr64da64.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da64.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.avr64da64.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da64.build.variant=64pin-standard
avrdaopti.menu.chip.avr32da28=AVR32DA28
avrdaopti.menu.chip.avr32da28.build.mcu=avr32da28
avrdaopti.menu.chip.avr32da28.upload.maximum_size=32256
avrdaopti.menu.chip.avr32da28.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.avr32da28.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr32da32=AVR32DA32
avrdaopti.menu.chip.avr32da32.build.mcu=avr32da32
avrdaopti.menu.chip.avr32da32.upload.maximum_size=32256
avrdaopti.menu.chip.avr32da32.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.avr32da32.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr32da48=AVR32DA48
avrdaopti.menu.chip.avr32da48.build.mcu=avr32da48
avrdaopti.menu.chip.avr32da48.upload.maximum_size=32256
avrdaopti.menu.chip.avr32da48.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.avr32da48.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da48.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdaopti.menu.clock.24internal=24 MHz internal
avrdaopti.menu.clock.24internal.build.f_cpu=24000000L
avrdaopti.menu.clock.24internal.build.speed=24
avrdaopti.menu.clock.24internal.build.clocksource=0
avrdaopti.menu.clock.20internal=20 MHz internal
avrdaopti.menu.clock.20internal.build.f_cpu=20000000L
avrdaopti.menu.clock.20internal.build.speed=20
avrdaopti.menu.clock.20internal.build.clocksource=0
avrdaopti.menu.clock.16internal=16 MHz internal
avrdaopti.menu.clock.16internal.build.f_cpu=16000000L
avrdaopti.menu.clock.16internal.build.speed=16
avrdaopti.menu.clock.16internal.build.clocksource=0
avrdaopti.menu.clock.12internal=12 MHz internal
avrdaopti.menu.clock.12internal.build.f_cpu=12000000L
avrdaopti.menu.clock.12internal.build.speed=12
avrdaopti.menu.clock.12internal.build.clocksource=0
avrdaopti.menu.clock.10internal=10 MHz internal
avrdaopti.menu.clock.10internal.build.f_cpu=10000000L
avrdaopti.menu.clock.10internal.build.speed=10
avrdaopti.menu.clock.10internal.build.clocksource=0
avrdaopti.menu.clock.8internal=8 MHz internal
avrdaopti.menu.clock.8internal.build.f_cpu=8000000L
avrdaopti.menu.clock.8internal.build.speed=8
avrdaopti.menu.clock.8internal.build.clocksource=0
avrdaopti.menu.clock.4internal=4 MHz internal
avrdaopti.menu.clock.4internal.build.f_cpu=4000000L
avrdaopti.menu.clock.4internal.build.speed=4
avrdaopti.menu.clock.4internal.build.clocksource=0
avrdaopti.menu.clock.1internal=1 MHz internal
avrdaopti.menu.clock.1internal.build.f_cpu=1000000L
avrdaopti.menu.clock.1internal.build.speed=1
avrdaopti.menu.clock.1internal.build.clocksource=0
avrdaopti.menu.clock.24extclock=24 MHz ext. clock
avrdaopti.menu.clock.24extclock.build.f_cpu=24000000L
avrdaopti.menu.clock.24extclock.build.speed=24
avrdaopti.menu.clock.24extclock.build.clocksource=2
avrdaopti.menu.clock.20extclock=20 MHz ext. clock
avrdaopti.menu.clock.20extclock.build.f_cpu=20000000L
avrdaopti.menu.clock.20extclock.build.speed=20
avrdaopti.menu.clock.20extclock.build.clocksource=2
avrdaopti.menu.clock.16extclock=16 MHz ext. clock
avrdaopti.menu.clock.16extclock.build.f_cpu=16000000L
avrdaopti.menu.clock.16extclock.build.speed=16
avrdaopti.menu.clock.16extclock.build.clocksource=2
avrdaopti.menu.clock.12extclock=12 MHz ext. clock
avrdaopti.menu.clock.12extclock.build.f_cpu=12000000L
avrdaopti.menu.clock.12extclock.build.speed=12
avrdaopti.menu.clock.12extclock.build.clocksource=2
avrdaopti.menu.clock.8extclock=8 MHz ext. clock
avrdaopti.menu.clock.8extclock.build.f_cpu=8000000L
avrdaopti.menu.clock.8extclock.build.speed=8
avrdaopti.menu.clock.8extclock.build.clocksource=2
avrdaopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdaopti.menu.clock.28internal.build.f_cpu=28000000L
avrdaopti.menu.clock.28internal.build.speed=28
avrdaopti.menu.clock.28internal.build.clocksource=0
avrdaopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdaopti.menu.clock.32internal.build.f_cpu=32000000L
avrdaopti.menu.clock.32internal.build.speed=32
avrdaopti.menu.clock.32internal.build.clocksource=0
avrdaopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdaopti.menu.clock.25extclock.build.f_cpu=25000000L
avrdaopti.menu.clock.25extclock.build.speed=25
avrdaopti.menu.clock.25extclock.build.clocksource=2
avrdaopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdaopti.menu.clock.28extclock.build.f_cpu=28000000L
avrdaopti.menu.clock.28extclock.build.speed=28
avrdaopti.menu.clock.28extclock.build.clocksource=2
avrdaopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdaopti.menu.clock.30extclock.build.f_cpu=30000000L
avrdaopti.menu.clock.30extclock.build.speed=30
avrdaopti.menu.clock.30extclock.build.clocksource=2
avrdaopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdaopti.menu.clock.32extclock.build.f_cpu=32000000L
avrdaopti.menu.clock.32extclock.build.speed=32
avrdaopti.menu.clock.32extclock.build.clocksource=2
avrdaopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdaopti.menu.clock.36extclock.build.f_cpu=36000000L
avrdaopti.menu.clock.36extclock.build.speed=36
avrdaopti.menu.clock.36extclock.build.clocksource=2
avrdaopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdaopti.menu.clock.40extclock.build.f_cpu=40000000L
avrdaopti.menu.clock.40extclock.build.speed=40
avrdaopti.menu.clock.40extclock.build.clocksource=2
avrdaopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdaopti.menu.clock.48extclock.build.f_cpu=48000000L
avrdaopti.menu.clock.48extclock.build.speed=48
avrdaopti.menu.clock.48extclock.build.clocksource=2


