SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrdbopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.portname=Serial
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrdbopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdbopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrdbopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdbopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdbopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrdbopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.portname=Serial1
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdbopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdbopti.menu.bootloaderusart.ser2.bootloader.portname=Serial2
avrdbopti.menu.bootloaderusart.ser2.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (32+-pin only)
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.portname=Serial2
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdbopti.menu.bootloaderusart.ser3.bootloader.portname=Serial3
avrdbopti.menu.bootloaderusart.ser3.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.portname=Serial3
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdbopti.menu.bootloaderusart.ser4.bootloader.portname=Serial4
avrdbopti.menu.bootloaderusart.ser4.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.portname=Serial4
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdbopti.menu.bootloaderusart.ser5.bootloader.portname=Serial5
avrdbopti.menu.bootloaderusart.ser5.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.portname=Serial5
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.portswap=1



##########################################################################
#                                                                        #
#   ###  #     # ####      ####  ####            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #   #          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  ####            ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DD parts   #
#________________________________________#
#avrddopti.build.board=avrdd
#avrddopti.build.core=dxcore
#avrddopti.build.text_section_start=.text=0x200
#avrddopti.build.extra_flags= -DTWI_{build.wire.mode} -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
#avrddopti.build.export_merged_output=false
#avrddopri.build.highestcb=B2
#avrddopti.build.printf=
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
#avrddopti.bootloader.tool=avrdude
#avrddopti.bootloader.WDTCFG=0x00
#avrddopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
#avrddopti.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}000
#avrddopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
##avrddopti.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
#avrddopti.bootloader.CODESIZE=0x00
#avrddopti.bootloader.BOOTSIZE=0x01
#avrddopti.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
#avrddopti.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex -a write

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
#avrddopti.build.mcupostfix=opti
#avrddopti.build.printfabr=
#avrddopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
#avrddopti.menu.chip.avr64dd14=AVR64DD14
#avrddopti.menu.chip.avr64dd14.build.mcu=avr64dd14
#avrddopti.menu.chip.avr64dd14.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.avr64dd14.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd14.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd14.build.highestcb=B1
#avrddopti.menu.chip.avr64dd14.build.variant=14pin-ddseries
#avrddopti.menu.chip.avr64dd20=AVR64DD20
#avrddopti.menu.chip.avr64dd20.build.mcu=avr64dd20
#avrddopti.menu.chip.avr64dd20.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.avr64dd20.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd20.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd20.build.highestcb=B1
#avrddopti.menu.chip.avr64dd20.build.variant=20pin-ddseries
#avrddopti.menu.chip.avr64dd28=AVR64DD28
#avrddopti.menu.chip.avr64dd28.build.mcu=avr64dd28
#avrddopti.menu.chip.avr64dd28.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.avr64dd28.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd28.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd28.build.variant=28pin-ddseries
#avrddopti.menu.chip.avr64dd32=AVR64DD32
#avrddopti.menu.chip.avr64dd32.build.mcu=avr64dd32
#avrddopti.menu.chip.avr64dd32.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.avr64dd32.upload.maximum_size=65024
#avrddopti.menu.chip.avr64dd32.upload.maximum_data_size=8192
#avrddopti.menu.chip.avr64dd32.build.variant=32in-ddseries
#avrddopti.menu.chip.avr32dd14=AVR32DD14
#avrddopti.menu.chip.avr32dd14.build.mcu=avr32dd14
#avrddopti.menu.chip.avr32dd14.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd14.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd14.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd14.build.highestcb=B1
#avrddopti.menu.chip.avr32dd14.build.variant=14pin-ddseries
#avrddopti.menu.chip.avr32dd20=AVR32DD20
#avrddopti.menu.chip.avr32dd20.build.mcu=avr32dd20
#avrddopti.menu.chip.avr32dd20.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd20.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd20.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd20.build.highestcb=B1
#avrddopti.menu.chip.avr32dd20.build.variant=20pin-ddseries
#avrddopti.menu.chip.avr32dd28=AVR32DD28
#avrddopti.menu.chip.avr32dd28.build.mcu=avr32dd28
#avrddopti.menu.chip.avr32dd28.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd28.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd28.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd28.build.variant=28pin-ddseries
#avrddopti.menu.chip.avr32dd32=AVR32DD32
#avrddopti.menu.chip.avr32dd32.build.mcu=avr32dd32
#avrddopti.menu.chip.avr32dd32.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr32dd32.upload.maximum_size=32256
#avrddopti.menu.chip.avr32dd32.upload.maximum_data_size=4096
#avrddopti.menu.chip.avr32dd32.build.variant=32in-ddseries
#avrddopti.menu.chip.avr16dd14=AVR16DD14
#avrddopti.menu.chip.avr16dd14.build.mcu=avr16dd14
#avrddopti.menu.chip.avr16dd14.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd14.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd14.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd14.build.highestcb=B1
#avrddopti.menu.chip.avr16dd14.build.variant=14pin-ddseries
#avrddopti.menu.chip.avr16dd20=AVR16DD20
#avrddopti.menu.chip.avr16dd20.build.mcu=avr16dd20
#avrddopti.menu.chip.avr16dd20.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd20.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd20.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd20.build.highestcb=B1
#avrddopti.menu.chip.avr16dd20.build.variant=20pin-ddseries
#avrddopti.menu.chip.avr16dd28=AVR16DD28
#avrddopti.menu.chip.avr16dd28.build.mcu=avr16dd28
#avrddopti.menu.chip.avr16dd28.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd28.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd28.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd28.build.variant=28pin-ddseries
#avrddopti.menu.chip.avr16dd32=AVR16DD32
#avrddopti.menu.chip.avr16dd32.build.mcu=avr16dd32
#avrddopti.menu.chip.avr16dd32.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.avr16dd32.upload.maximum_size=15872
#avrddopti.menu.chip.avr16dd32.upload.maximum_data_size=2048
#avrddopti.menu.chip.avr16dd32.build.variant=32in-ddseries

